v2206/CHAD_validations/RTI_thermal/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

L       0.04;
H       0.12;
rL      200;
rH      600;
// rL      100;
// rH      300;

vertices
(
    /*0*/ (0.00  0.00   0.000)
    /*1*/ ($L    0.00   0.000)
    /*2*/ ($L    $H     0.000)
    /*3*/ (0.00  $H     0.000)
    /*4*/ (0.00  0.00   0.001)
    /*5*/ ($L    0.00   0.001)
    /*6*/ ($L    $H     0.001)
    /*7*/ (0.00  $H     0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($rL $rH 1) 
    simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (5 1 0 4)
            (2 1 5 6)
            (2 6 7 3)
            (7 4 0 3)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (6 5 4 7)
            (3 0 1 2)
        );
    }
);

mergePatchPairs
(
);


// ************************************************************************* //
