v2206/CHAD_validations/RTI_thermal/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(rhoPhi,U)    Gauss limitedLinearV 1;
    div(phi,alpha)   Gauss vanLeer;
    // div(phi,alpha)   Gauss interfaceCompression vanLeer 1;
    div(phirb,alpha) Gauss linear;
    "div\(phi,.*rho.*\)" Gauss upwind;
    div(rhoPhi,T)  Gauss limitedLinear 1;
    div(rhoPhi,K)  Gauss upwind;
    div(phi,p)     Gauss upwind;

    turbulence      Gauss limitedLinear 1;
    div(rhoPhi,k)       $turbulence;
    div(rhoPhi,epsilon) $turbulence;
    div(rhoPhi,R)       $turbulence;
    div(rhoPhi,omega)   $turbulence;
    div((rho*R))    Gauss linear;
    div(R)          Gauss linear;
    
    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
