v2206/CHAD_validations/RTI_thermal/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    volScalarFieldValue alpha.lightFluid 0
    volScalarFieldValue alpha.denseFluid 1
    volScalarFieldValue T 300
);

regions
(
    boxToCell
    {
        box (0.00   -1.50   0.00) (1.00  0.00   0.10);
        fieldValues
        (
            volScalarFieldValue alpha.lightFluid 1
            volScalarFieldValue alpha.denseFluid 0
            volScalarFieldValue T 250
        );
    }
    // boxToCell
    // {
    //     box (0.4   -0.20   0.00) (0.60  0.00   0.10);
    //     fieldValues
    //     (
    //         volScalarFieldValue alpha.lightFluid 0
    //         volScalarFieldValue alpha.denseFluid 1
    //         volScalarFieldValue T 250
    //     );
    // }
);


// ************************************************************************* //
